app/models/administrator.rb

  def create_associated_agency
    agency = Agency.create(name: "#{first_name} #{last_name}'s Agency", administrator_id: id)
---
INSERT INTO "agencies" ("user_id", "administrator_id", "name", "description", "address", "phone_number", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"